[
  {
    "name": "Managing Anxiety Attacks Escape Room",
    "friendly_name": "sample-escape-room",
    "description": "A student at ABC High is going through a hard time dealing with the stresses of school, and they begin to feel really anxious in class. Help the student manage their anxiety and escape the class!",
    "scene_ids": [4, 5, 6],
    "is_published": true,
    "is_previewable": true,
    "publish_link": "www.publishlink.com/sample-escape-room",
    "preview_link": "www.previewlink.com/sample-escape-room",
    "expected_solve_time": "5",
    "introduction_data": {
      "header_text": "Welcome to Managing Anxiety Attacks Escape Room"
    },
    "conclusion_data": {
      "header_text": "Great job, you escaped the Managing Anxiety Attacks Escape Room! You managed to help a student at a school that was going through an anxiety attack reach home safely. Once home, you were able to successfully help them reach their bedroom, where XYZ. By going through this escape room, you have now learnt valuable skills that you can use in your everyday life to manage anxiety attacks.",
      "paragraph_text": "By solving the puzzles and going through the room, you have learnt important skills such as techniques you can use when having an anxiety attack, solving problems and finding a focus object. You have also learnt about resources that the Calgary Distress Center provides when you or someone you know may be experiencing an anxiety attack. If you enjoyed thr room, or have some feedback, check out the links below to share the escape room link, or give feedback to the admins!",
      "share_link": "https://backend-dev.jaydhulia.com/sample-escape-room",
      "external_link": "https://calgaryconnecteen.com/"
    },
    "transitions": [
      {
        "data": [
          {
            "text": "You're a high school student stuck in class. The clock ticks past as you wait for the bell to ring. Your teacher Mrs. Smith says, \"Alright, now we are going to be talking about the 8 page history paper due next week, there will be 4 components to the structure...\""
          },
          {
            "text": "You look down at your agenda. \"8 page paper, in a week!? I still have a Bio lab, Math quiz and a Chem exam I have to prepare for next week. I can't, I just can't. It's impossible. I can't breath. What am I going to do??\""
          },
          {
            "text": "Your hands start to tremble as you grasp your chest, you can't even tell if you are breathing properly anymore. You feel like you are going to pass out. Everything begins to look blurry and you notice your body start to subtly shake. You know what's happening: it's an anxiety attack"
          },
          {
            "text": "\"I have to get out of here, I have to go home. I feel like I'm gonna puke.\" Escape the room to get back home!"
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "You were finally able to escape the class. Sweat trickles down your back as you run back home. If you had stayed any longer in that class and with added stress, you might have needed medical attention. If you ever feel an anxiety attack coming, get help and remove yourself from the stressful situation!"
          },
          {
            "text": "Let's go back home and get some rest. School's been too stressful for you."
          },
          {
            "text": "You manage to get a bus and get yourself home. As you walk up to the door, you notice that your parents have come early for work. That's not good: they're going to pepper me with questions as soon as I enter the room"
          },
          {
            "text": "With a flash of realization, you realize that your anxiety attack in school was related to some project that you forgot to do. When was the project due again? Let's try to find out without talking to Mom and Dad."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "You have escaped the living room. You finally remember now. You have an art project due on May 26."
          },
          {
            "text": "Phew - I made it upstairs without my parents noticing. That would have been a train wreck if they saw me. They'd probably be speechless again if I told them how I was feeling."
          },
          {
            "text": "I hate it when they look at me with such blank expressions. . . what am I going to do with myself now."
          },
          {
            "text": "Maybe I'll start working on my art paper. Better than waiting till the last minute I guess. . . My head and my chest still hurt."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "Finally! Feeling much less stressed now. Looking at those plants and rummaging through those pictures really help when I'm stressed."
          },
          {
            "text": "Despite that, I really need to change my password and make it easier to remember. Let's get cracking on this assignment shall we?"
          },
          { "text": "Congratulations, you have escaped!" }
        ],
        "currPosition": 0
      }
    ],
    "display_image_url": ""
  }
]
