[
  {
    "name": "Youth in Crisis - 1",
    "friendly_name": "youth-in-crisis-1",
    "description": "A youth is experiencing a crisis and they need to seek help for said crisis (i.e. You find yourself sitting at your desk needing to find a way out. The History Teacher is talking about the paper that is due in a week, you look down and see you haven’t even started writing your paper. You think back to the fact that you still have one Biology lab, one Math quiz and one Chemistry exam in the same week. The room begins to feel like it’s slanting, your palms are sweating, you feel your heart beating faster and your hands begin to shake – how will you escape and find help?)",
    "scene_ids": [8, 9, 10, 11, 12],
    "is_published": true,
    "is_previewable": true,
    "publish_link": "https://interactive.calgaryconnecteen.com/youth-in-crisis-1",
    "preview_link": "https://interactive.calgaryconnecteen.com/youth-in-crisis-1",
    "expected_solve_time": "5",
    "introduction_data": {
      "header_text": "Youth in Crisis Escape Room"
    },
    "conclusion_data": {
      "header_text": "Great job, you escaped the Youth in Crisis Escape Room! Thank you for playing! You were able to find support for the character and got some insight on what it can be like if you are in a crisis. To learn more about ConnecTeen please visit our website <a href='https://calgaryconnecteen.com'>here</a>.",
      "paragraph_text": "By solving the puzzles and going through the room, you have learnt important skills such as being aware of triggers (many tasks, lots of school work), techniques you can use when having an anxiety attack, and helpful resources. When you are in a crisis, it is hard to see options and ask for help. You may feel like you don't deserve help, may talk down to yourself, and experience low self-esteem when going through a challenging time. During these times, you can use the coping strategies you learnt about today such as music, reading, music and journaling to help feel better. You should also remember that it is okay to reach out for help and support - your friends as well as Calgary ConnecTeen are available for your support.",
      "share_link": "https://interactive.calgaryconnecteen.com/youth-in-crisis-1",
      "external_link": "https://forms.gle/vFmVvh5svmwPnVkY6"
    },
    "transitions": [
      {
        "data": [
          {
            "text": "You're a high school student in class. Your teacher Mr. Smith says, \"Alright, now we are going to be talking about the 8 page history paper due next week, there will be 4 components to the structure...\""
          },
          {
            "text": "You look down at your agenda. \"8 page paper, in a week!? I still have a Bio lab, Math quiz and a Chem exam I have to prepare for next week. I can't, I just can't. It's impossible. I can't breath. What am I going to do??\""
          },
          {
            "text": "Your hands start to tremble as you grasp your chest, you can't even tell if you are breathing properly anymore. You feel like you are going to pass out. Everything begins to look blurry and you notice your body start to subtly shake."
          },
          {
            "text": "\"I have to get out of here, I have to go home. I feel like I'm gonna puke.\" Escape the room to get back home!"
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "\"Sweet, I remembered my locker combo. I'll talk to Mr. Smith now.\""
          },
          {
            "text": "You ask to leave the class so that you can go to the nurses office. You feel uneasy as you can see everyone in class turned to stare at you. Mr. Smith dismisses you and hopes for you to feel better soon. You nod your head, gather your things and leave"
          },
          {
            "text": "You enter the house and see that your parents are cooking in the kitchen, the stairs going up are next to the kitchen. You hide by the closet door as they keep walking back and forth as they prepare dinner."
          },
          {
            "text": "\"Ahhhh how do I get them to go to the living room so I run upstairs???\""
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "That should work! You lure Strawberry to you with the string and mouse. After you throw the bell at the radio, Strawberry chases it and the radio starts to play music."
          },
          {
            "text": "Your parents go to the living room to figure out what happened. While they are occupied turning off the radio, you run upstairs. Strawberry runs after you!"
          },
          {
            "text": "\"Phew - I made it upstairs without my parents noticing. That would have been a train wreck if they saw me. They'd probably be speechless again if I told them how I was feeling. I hate it when they look at me with such blank expression...\""
          },
          {
            "text": "\"What should I do now. Maybe I'll start working on my History paper. Better than waiting until the last minute I guess. My head and chest still hurt.\""
          },
          {
            "text": "You open up your laptop and realize you cannot remember your pin. \"What is wrong with me?!?\""
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "Right right, that's Strawberry's birthday. \"Sorry I forgot Strawberry\", you say as you lean down to pet your cat Strawberry on the head."
          },
          {
            "text": "\"I can't believe I thought I could do this!? This way to much work, I still have Bio, Math - *cough\""
          },
          {
            "text": "You begin to have shallow breathes and clutch your chest again. You look around the room for anything that might help you calm down."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "\"Right, breathing slowly helps me calm down first before I can do other things. But it's important that I am in a comfortable position or I start to feel scared and worried again.\""
          },
          {
            "text": "You adjust yourself to be in a position that helps you feel grounded and connected to the present. You start from 5 and breathe in, 4 you breathe out, and so on. You remind yourself to take time and repeat the cycle until you feel at ease, even if its only slightly."
          },
          {
            "text": "\"This is hopeless!! I AM HOPELESS. IT'S ALWAYS LIKE THIS. I CAN'T DEAL WITH THIS ANYMORE. I can't deal with school, my feelings, anything! I want this all to be over. My parents don't even understand how I feel. Who do I even talk to about this. . .\" *begins to cry.*"
          },
          {
            "text": "You remember talking to your Guidance Counsellor once and they gave you a card to a Crisis Line called ConnecTeen. The Guidance Counsellor said that youth their age answer the lines. You take the card out of your wallet and look for the texting number. You bring out your cellphone."
          },
          {
            "text": "\"I guess I can try this, what else do I have to lose. Wait. . . what is my phone pin!?\""
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "Finally! I remembered my pin. Now I can talk to someone."
          },
          {
            "text": "You punch in the ConnecTeen phone number (587-333-2724) into your messages and start a new thread."
          },
          {
            "text": "You take a deep breathe and begin to type.",
            "imageSrc": "https://dcc-bp-public-dev.s3.us-east-2.amazonaws.com/images/f65991fa9c9f25100bba9113f42c1b5a.png"
          },
          {
            "text": "A reply comes in!",
            "imageSrc": "https://dcc-bp-public-dev.s3.us-east-2.amazonaws.com/images/8648a60f655cb48c0ef29eab9abebc5f.png"
          },
          {
            "text": "You begin to cry as it's nice to hear someone ask you what's going on. You continue the conversation."
          }
        ],
        "currPosition": 0
      }
    ],
    "display_image_url": ""
  }
]
