[
  {
    "name": "Supporting a Youth in Crisis",
    "friendly_name": "supporting-youth-in-crisis",
    "description": "When someone is going through a crisis it can sometimes be very obvious. Other times, it can be really discrete – how can you find ways to support people around you?",
    "scene_ids": [13, 14, 15, 16],
    "is_published": true,
    "is_previewable": true,
    "publish_link": "https://interactive.calgaryconnecteen.com/supporting-youth-in-crisis",
    "preview_link": "https://interactive.calgaryconnecteen.com/supporting-youth-in-crisis",
    "expected_solve_time": "5",
    "introduction_data": {
      "header_text": "Youth in Crisis Escape Room"
    },
    "conclusion_data": {
      "header_text": "Great job, you escaped the Supporting a Youth in Crisis Escape Room! Thank you for playing! You were able to find ways to include them in class and passed them a resource they could possibly use. To learn more about ConnecTeen please visit our website <a href='https://calgaryconnecteen.com'>here</a>.",
      "paragraph_text": "By solving the puzzles and going through the room, you have learnt important skills such as recognizing signs of stress and physical cues, being more inclusive and creating a safe space. You also learnt about some techniques you can use to reach out to peers who are distressed. When someone is in a crisis, it is hard to see options and ask for help. The person may feel like they don't deserve help, may talk down to themself, and experience low self-esteem when going through a challenging time. During these times, you can use the strategies you learnt about today such as recognizing signs, reaching out and asking open-ended questions about common interests to help them feel better. You should also remind them it is okay to reach out for help and support - their friends as well as Calgary ConnecTeen are available for their support.",
      "share_link": "https://interactive.calgaryconnecteen.com/supporting-youth-in-crisis",
      "external_link": "https://forms.gle/nnVJhh9RGX9YEW1A7"
    },
    "transitions": [
      {
        "data": [
          {
            "text": "You're a high school student in class. Today is Friday and everyone is ready for the weekend!"
          },
          {
            "text": "There is a group project we have to complete in class today so some people are feeling a bit on edge about it. Let's say hi to everyone and check in!"
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "You waved to Skylar. They look at you briefly then look back down at their desk."
          },
          {
            "text": "The teacher enters the room and everyone goes to their seats. Class is going to start soon."
          },
          {
            "text": "Mr. Smith greeted everyone good morning then asked the class to open up the text book to start class."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "Skylar is the only one without a textbook. I wonder why. That doesn't matter though I can offer to share mine for today."
          },
          {
            "text": "\"Hey Skylar, I noticed you don't have a text book. We can share mine!\""
          },
          {
            "text": "Skylar looked surprised at first then they smiled. They look relieved and their leg has stopped shaking from earlier."
          },
          {
            "text": "Mr. Smith finished their lecture and it's time for our break. Skylar thanked you for sharing your textbook. They haven't bought theirs yet as its pretty expensive."
          },
          {
            "text": "Everyone walked on over to the group sitting area. You get up to go eat lunch with everyone and notice that Skylar is the only person who hasn't walked over. Maybe if we strike up a conversation we can invite them over casually."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "Skylar smiles and starts to talk about their favorite character. You too laugh for a bit and then you invite them over to eat lunch. They agree and you both head on over to the group."
          },
          {
            "text": "You had fun at lunch with everyone. Now it's time for the group project. Everyone looks really nervous again. You're in a group of 4 and happen to be paired with Alex, Gray and Skylar. Everyone begins to discuss."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "The group project was a success and you all scored well."
          },
          {
            "text": "It's now the end of the day and everyone will be heading home for. Thankfully its the weekend so you can have a break from a tough week of school!"
          },
          {
            "text": "Before you go let's see if there is something you can give your new friend in case they might need extra support."
          }
        ],
        "currPosition": 0
      }
    ],
    "display_image_url": ""
  }
]
