[
  {
    "name": "Supporting a Youth in Crisis",
    "friendly_name": "youth-in-crisis-2",
    "description": "You find yourself sitting at your desk needing to find a way out. The History Teacher is talking about the paper that is due in a week, you look down and see you haven't even started writing your paper. You think back to the fact that you still have one Biology lab, one Math quiz and one Chemistry exam in the same week. The room begins to feel like it's slanting, your palms are sweating, you feel your heart beating faster and your hands begin to shake - how will you escape and find help?",
    "scene_ids": [13, 14, 15, 16, 17],
    "is_published": true,
    "is_previewable": true,
    "publish_link": "https://interactive.calgaryconnecteen.com/youth-in-crisis-2",
    "preview_link": "https://interactive.calgaryconnecteen.com/youth-in-crisis-2",
    "expected_solve_time": "5",
    "introduction_data": {
      "header_text": "Youth in Crisis Escape Room"
    },
    "conclusion_data": {
      "header_text": "Great job, you escaped the Youth in Crisis Escape Room! Thank you for playing! You were able to find ways to include them in class and passed them a resource they could possibly use. Here is some take away points from the escape room. To learn more about ConnecTeen please visit our website <a href='https://calgaryconnecteen.com'>here</a>.",
      "paragraph_text": "By solving the puzzles and going through the room, you have learnt important skills such as when people feel uncomfortable or stressed, everyone can demonstrate it in different ways. Being able to take a step back from time to time, observe your surroundings and checking in on people is a great way to connect with someone. Sometimes its hard to ask for help, taking steps to provide that helping hand out first can make it seem less scary. It's a lot harder to connect with people when you use close-ended questions, try open end-ended questions. It's always important to create space for everyone, if someone is having a hard time making space for themselves you can help include them by giving them the floor to speak. If you're not sure how to support someone its okay to refer people to community resources.",
      "share_link": "https://interactive.calgaryconnecteen.com/youth-in-crisis-2",
      "external_link": "https://forms.gle/vFmVvh5svmwPnVkY6"
    },
    "transitions": [
      {
        "data": [
          {
            "text": "You're a high school student in class. Your teacher Mr. Smith says, \"Alright, now we are going to be talking about the 8 page history paper due next week, there will be 4 components to the structure...\""
          },
          {
            "text": "You look down at your agenda. \"8 page paper, in a week!? I still have a Bio lab, Math quiz and a Chem exam I have to prepare for next week. I can't, I just can't. It's impossible. I can't breath. What am I going to do??\""
          },
          {
            "text": "Your hands start to tremble as you grasp your chest, you can't even tell if you are breathing properly anymore. You feel like you are going to pass out. Everything begins to look blurry and you notice your body start to subtly shake."
          },
          {
            "text": "\"I have to get out of here, I have to go home. I feel like I'm gonna puke.\" Escape the room to get back home!"
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "You waved to Skylar. They look at you briefly then look back down at their desk."
          },
          {
            "text": "The teacher enters the room and everyone goes to their seats. Class is going to start soon."
          },
          {
            "text": "Mr. Smith greeted everyone good morning then asked the class to open up the text book to start class."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "Skylar is the only one without a textbook. I wonder why. That doesn't matter though I can offer to share mine for today."
          },
          {
            "text": "\"Hey Skylar, I noticed you don't have a text book. We can share mine!\""
          },
          {
            "text": "Skylar looked surprised at first then they smiled. They look relieved and their leg has stopped shaking from earlier."
          },
          {
            "text": "Mr. Smith finished their lecture and it's time for our break. Skylar thanked you for sharing your textbook. They haven't bought theirs yet as its pretty expensive."
          },
          {
            "text": "Everyone walked on over to the group sitting area. You get up to go eat lunch with everyone and notice that Skylar is the only person who hasn't walked over. Maybe if we strike up a conversation we can invite them over casually."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "Skylar smiles and starts to talk about their favorite character. You too laugh for a bit and then you invite them over to eat lunch. They agree and you both head on over to the group."
          },
          {
            "text": "You had fun at lunch with everyone. Now it's time for the group project. Everyone looks really nervous again. You're in a group of 4 and happen to be paired with Alex, Gray and Skylar. Everyone begins to discuss."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "The group project was a success and you all scored well."
          },
          {
            "text": "It's now the end of the day and everyone will be heading home for. Thankfully its the weekend so you can have a break from a tough week of school!"
          },
          {
            "text": "Before you go let's see if there is something you can give your new friend in case they might need extra support."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "\"Hey, it was cool hearing from you today. i wanted to give you this before you go. totally up to you if you want to use this, no pressure. but basically if you're ever going through something tough and you want to talk to someone about it and you don't feel comfortable telling me or anyone else you can try this line. i've used it in the past and it's been helpful so i wanted to pass it along just in case.\""
          }
        ],
        "currPosition": 0
      }
    ],
    "display_image_url": ""
  }
]
