[
  {
    "name": "Managing Anxiety Attacks Escape Room",
    "friendly_name": "sample-escape-room",
    "description": "A student at ABC High is going through a hard time dealing with the stresses of school, and they begin to feel really anxious in class. Help the student manage their anxiety and escape the class!",
    "scene_ids": [4, 5],
    "is_published": true,
    "is_previewable": true,
    "publish_link": "www.publishlink.com/sample-escape-room",
    "preview_link": "www.previewlink.com/sample-escape-room",
    "expected_solve_time": "5",
    "introduction_data": {
      "header_text": "Welcome to Managing Anxiety Attacks Escape Room"
    },
    "conclusion_data": {
      "header_text": "Great job, you escaped the Managing Anxiety Attacks Escape Room! You managed to help a student at a school that was going through an anxiety attack reach home safely. Once home, you were able to successfully help them reach their bedroom, where XYZ. By going through this escape room, you have now learnt valuable skills that you can use in your everyday life to manage anxiety attacks.",
      "paragraph_text": "By solving the puzzles and going through the room, you have learnt important skills such as techniques you can use when having an anxiety attack, solving problems and finding a focus object. You have also learnt about resources that the Calgary Distress Center provides when you or someone you know may be experiencing an anxiety attack. If you enjoyed thr room, or have some feedback, check out the links below to share the escape room link, or give feedback to the admins!",
      "share_link": "https://backend-dev.jaydhulia.com/sample-escape-room",
      "external_link": "https://calgaryconnecteen.com/"
    },
    "transitions": [
      {
        "data": [
          {
            "text": "You are a student having a sudden panic attack about an upcoming test. Try to escape the class to get a breather!"
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "The bell rings and you grab your books and shove them in your bag. Slinging the bag over your shoulder, you quickly leave the class. Thank god that class is over with, and you step outside for a breather."
          },
          {
            "text": "You are feeling stressed for some reason. What can it be?? You cannot focus and you decide to go home early and just relax."
          },
          {
            "text": "You finally arrive home. Your parents are in the living room. If you talk to them, they will start asking a million questions about why you left school early."
          },
          {
            "text": "Maybe there is something in the room that can help figure out Maybe there is something in the room that can help figure out why I am feeling stressed. Perhaps a test or project is due soon? Let's try and find out."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "You have escaped the living room. You finally remember now. You have an art project due on May 26."
          },
          { "text": "Congratulations, you have escaped!" }
        ],
        "currPosition": 0
      }
    ],
    "screenshot_url": ""
  }
]
