[
  {
    "name": "Managing Anxiety Attacks Escape Room",
    "friendly_name": "sample-escape-room",
    "description": "A student at ABC High is going through a hard time dealing with the stresses of school, and they begin to feel really anxious in class. Help the student manage their anxiety and escape the class!",
    "scene_ids": [4, 5],
    "is_published": true,
    "is_previewable": true,
    "publish_link": "www.publishlink.com/sample-escape-room",
    "preview_link": "www.previewlink.com/sample-escape-room",
    "expected_solve_time": "5",
    "introduction_data": {
      "header_text": "Welcome to Managing Anxiety Attacks Escape Room"
    },
    "conclusion_data": {
      "header_text": "You escaped Managing Anxiety Attacks Escape Room",
      "paragraph_text": "Check out the link below",
      "share_link": "www.sharelink.com/managing-anxiety-attacks-escape-room"
    },
    "transitions": [
      {
        "data": [
          {
            "text": "You are a student having a sudden panic attack about an upcoming test. Try to escape the class to get a breather!"
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "The bell rings and you grab your books and shove them in your bag. Slinging the bag over your shoulder, you quickly leave the class. Thank god that class is over with, and you step outside for a breather."
          },
          {
            "text": "You decide to go home early and just relax. So you start heading home while humming the new song your favourite artist just dropped."
          },
          {
            "text": "You finally arrive home. Time to chill out."
          },
          {
            "text": "Your parents are in the living room. If you talk to them, they will start asking a million questions about why you left school early. Leave the room without talking to the parents."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "You have escaped the living room. You finally remember now. You have an art project due on May 26."
          },
          { "text": "Congratulations, you have escaped!" }
        ],
        "currPosition": 0
      }
    ]
  }
]
