[
  {
    "name": "Youth in Crisis",
    "friendly_name": "youth-in-crisis",
    "description": "A student at ABC High is going through a hard time dealing with the stresses of school, and they begin to feel really anxious in class. Help the student manage their anxiety and escape the class!",
    "scene_ids": [4, 5, 6, 7],
    "is_published": true,
    "is_previewable": true,
    "publish_link": "https://interactive.calgaryconnecteen.com/youth-in-crisis",
    "preview_link": "https://interactive.calgaryconnecteen.com/youth-in-crisis",
    "expected_solve_time": "5",
    "introduction_data": {
      "header_text": "Youth in crisis"
    },
    "conclusion_data": {
      "header_text": "Great job, you escaped the Youth in Crisis Escape Room! Thank you for playing! You were able to find support for the character and got some insight on what it can be like if you are in a crisis. To learn more about ConnecTeen please visit our website <a href='https://calgaryconnecteen.com'>here</a>.",
      "paragraph_text": "By solving the puzzles and going through the room, you have learnt important skills such as being aware of triggers (many tasks, lots of school work), techniques you can use when having an anxiety attack, and helpful resources. When you are in a crisis, it is hard to see options and ask for help. You may feel like you don't deserve help, may talk down to yourself, and experience low self-esteem when going through a challenging time. During these times, you can use the coping strategies you learnt about today such as music, reading, music and journaling to help feel better. You should also remember that it is okay to reach out for help and support - your friends as well as Calgary ConnecTeen are available for your support.",
      "share_link": "https://interactive.calgaryconnecteen.com/youth-in-crisis",
      "external_link": "https://forms.gle/XfToJtsQa25mB1qQA"
    },
    "transitions": [
      {
        "data": [
          {
            "text": "You're a high school student stuck in class. The clock ticks past as you wait for the bell to ring. Your teacher Mrs. Smith says, \"Alright, now we are going to be talking about the 8 page history paper due next week, there will be 4 components to the structure...\""
          },
          {
            "text": "You look down at your agenda. \"8 page paper, in a week!? I still have a Bio lab, Math quiz and a Chem exam I have to prepare for next week. I can't, I just can't. It's impossible. I can't breath. What am I going to do??\""
          },
          {
            "text": "Your hands start to tremble as you grasp your chest, you can't even tell if you are breathing properly anymore. You feel like you are going to pass out. Everything begins to look blurry and you notice your body start to subtly shake. You know what's happening: it's an anxiety attack"
          },
          {
            "text": "\"I have to get out of here, I have to go home. I feel like I'm gonna puke.\" Escape the room to get back home!"
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "You were finally able to escape the class. Sweat trickles down your back as you run back home. If you had stayed any longer in that class and with added stress, you might have needed medical attention. If you ever feel an anxiety attack coming, get help and remove yourself from the stressful situation!"
          },
          {
            "text": "Let's go back home and get some rest. School's been too stressful for you."
          },
          {
            "text": "You manage to get a bus and get yourself home. As you walk up to the door, you notice that your parents have come early for work. That's not good: they're going to pepper me with questions as soon as I enter the room"
          },
          {
            "text": "With a flash of realization, you realize that your anxiety attack in school was related to some project that you forgot to do. When was the project due again? Let's try to find out without talking to Mom and Dad."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "You have escaped the living room. You finally remember now. You have an art project due on May 26."
          },
          {
            "text": "Phew - I made it upstairs without my parents noticing. That would have been a train wreck if they saw me. They'd probably be speechless again if I told them how I was feeling."
          },
          {
            "text": "I hate it when they look at me with such blank expressions. . . what am I going to do with myself now."
          },
          {
            "text": "Maybe I'll start working on my art paper. Better than waiting till the last minute I guess. . . My head and my chest still hurt."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "Finally! Feeling much less stressed now. Looking at those plants and rummaging through those pictures really help when I'm stressed."
          },
          {
            "text": "Despite that, I really need to change my password and make it easier to remember. Let's get cracking on this assignment shall we?"
          },
          {
            "text": " spent a few hours working on the paper. I still don't feel like it's at a high level. My parents have always told me that if I'm feeling unfocused or anxious, I should try to change scenery. You know what, I'll go to the cafe down the street! Hopefully that should jog my productivity."
          },
          {
            "text": "Alright, at the cafe! I was right: that change in scenery was super helpful. I'm feeling a bit tired though...perhaps I'll take a short nap."
          },
          {
            "text": "(alarm rings). Huh...OH NO! I overslept! Seems like the owner didn't see me and I'm locked out. Oh no! I can feel my heart racing. Ok calm down, you got this. I just got to find the password to get out of the cafe and get back home! Let's approach this calmly and carefully."
          }
        ],
        "currPosition": 0
      },
      {
        "data": [
          {
            "text": "Finally! Wow, my heart was never beating that fast before. I wonder what I would have done if I couldn't have gotten myself out."
          },
          {
            "text": "I should get going back home. My parents must be worried sick. After all the stress and panic attacks today, sleep is the biggest medicine. A full 8 hours of sleep...can't WAIT!"
          },
          { "text": "Congratulations, you have escaped!" }
        ],
        "currPosition": 0
      }
    ],
    "display_image_url": ""
  }
]
